/*
 * @Author: Elmer
 * @Date: 2018-09-03 10:12:25
 * @Last Modified by: Elmer
 * @Last Modified time: 2018-11-22 13:39:09
 */
// window.common对象添加接口地址扩展
(function () {
  // api接口地址列表
  window.common.const = {
    LOGINTITLE: '尊敬的客户您好！安全中心发现您的账号存在异常。为了保护您的账号安全，本次登录需要输入验证字符，以防恶意程序的自动登录',
    curTabIndex: 0, // 游戏协议默认选中第一个
    disagreeTitle: '我不同意',
    agreeTitle: '我同意',
    gameTitle: '游戏协议',
    protocolContentList: [ // 游戏协议内容
      {
        title: '通则',
        selcted: true,
        content:
          '<ol>' +
          '<li>为避免于本网站投注时之争议，请会员务必于进入网站前详阅本娱乐场所定之各项规则，客户一经“我同意”进入本网站进行投注时，即被视为已接受本娱乐场的所有协议与规则。</li>' +
          '<li>会员有责任确保自己的帐户以及登入资料的保密性，以会员帐号及密码进行的任何网上投注，将被视为有效。敬请不定时做密码变更之动作。若帐号密码被盗用，进行的投注，本公司一概不负赔偿责任。</li>' +
          '<li>本公司保留不定时更改本协定或游戏规则或保密条例，更改之条款将从更改发生后指定之日起生效，并保留一切有争议事项及最后的决策权。</li>' +
          '<li>用户须达到居住地国家法律规定之合法年龄方可使用线上娱乐场或网站。</li>' +
          '<li>网上投注如未能成功提交，投注将被视为无效。</li>' +
          '<li>凡玩家于出牌途中且尚无结果前自动或强制断线时，并不影响比赛之结果。</li>' +
          '<li>如遇发生不可抗拒之灾害，骇客入侵，网络问题造成数据丢失的情况，以本公司公告为最终方案。</li>' +
          '<li>特此声明，本公司将会对所有的电子交易进行记录，如有任何争议，本公司将会以注单记录为准。</li>' +
          '<li>本公司保留更改、修改现有条款或增加任何适当条款的权利，而条款改动后将会在会员端跑马灯上公布。</li>' +
          '<li>无论在任何情况下，本公司具有最终的解释权。开始新局。</li>' +
          '<li>若经本公司发现会员以不正当手法&lt;利用外挂程式&gt;进行投注或以任何非正常方式进行的个人、团体投注有损公司利益之投注情事发生，本公司保留权利取消该类注单以及注单产生之红利，并停用该会员帐号。</li>' +
          '<li>无风险投注包括在百家乐同时投注的庄闲，单双，大小。龙虎斗中同时投注龙虎，龙双龙单，虎双虎单。在轮盘同时投注黑红，单双，大小等相反的下注，本公司保留权利取消所有优惠、该注单以及单注产生之红利，并停用该会员账号之权利，不承担对此做出任何说明及解释之责任。</li>' +
          '<li>若本公司发现会员有重复申请帐号行为时，保留取消、收回会员所有优惠红利，以及优惠红利所产生的盈利之权利。每位玩家、每一住址、每一电子邮箱、每一电话号码、相同支付卡/信用卡号码，以及共享电脑环境 (例如:网吧、其他公共用电脑等)只能够拥有一个会员帐号，各项优惠只适用于每位客户在本公司唯一的帐户。</li>' +
          '</ol>'
      },
      {
        title: '在线娱乐城',
        selcted: false,
        content:
          '<ol>' +
          '<li>当您下注后，请等待显示“您共下注XXXX元”，这个讯息在中间的讯息窗口可以看见。</li>' +
          '<li>开牌后，若您已有下注，请确认您的输赢金额，这个讯息在中间的讯息窗口可以看见。</li>' +
          '<li>您的“总下注金额”及“赢得金额”亦会每局显示于右上角的视窗中，请会员详加确认。</li>' +
          '<li>当会员在游戏中途发生网路问题而断线，所有已被确定的投注仍然有效。会员再重新登入时，就可以查询游戏端内的“下注记录”查询发牌结果，会员的额度也会随着当局的输赢增加或减少。</li>' +
          '<li>如果您在讯息窗口看到“开牌”的话，而您的游戏画面未显示投注金额，这代表该局您的投注不成功，这有可能下注的时间太迟或是因为网路问题而没有被系统接受。</li>' +
          '<li>百家乐游戏在本网内设计为每手牌局前不销牌。</li>' +
          '<li>当会员进入游戏，超过5局没下注会有提示；若您连续10局未下注的时候将会被游戏弹出至首页，请会员重新登入。若会员于下注开牌期间强行登出，帐号将被系统锁住三分钟，请会员稍后再重新登入。</li>' +
          '<li>本网上游戏是在现场把牌通过扫描后将牌例显示在会员端荧幕上，故若牌没扫描到必将重新扫描一遍，若还是没有感应则把牌翻开由现场公务输入牌卡数码，牌例便会显示在会员端荧幕上。</li>' +
          '<li>当荷官不小心同时从牌靴中抽出两张牌，而扫描到的不是按顺序正确的那张牌：<br>（a）若牌局已开牌，而结果不符，系统将根据现况决定牌的先后摆放顺序之开牌结果进行手动开牌，并换上新牌靴开始新局。&nbsp;<br>（b）若牌局未开牌，则由现场公务决定牌的先后摆放顺序，牌局会如常继续。</li>' +
          '<li>在洗牌或将牌放入牌靴过程中，有牌不慎曝光，荷官会把牌叠起并重新洗牌，牌局将重新开始。</li>' +
          '<li>牌局进行中，未扬牌前(该张牌未于视讯显示点数花色前)，牌不慎离开台面，牌丢落地上，或离开视讯范围，则该牌局予以注销作废，所有下注本金退回。</li>' +
          '<li>若该牌已经过扫描且已扬牌后，该牌不慎离开台面，牌丢落地上，或离开视讯范围，因其不影响游戏之正确结果，牌由现场工务摆回后，该牌局正常行其结果仍视为有效。</li>' +
          '<li>派错牌例（已不须补牌，荷官仍补牌）现场工务会把多补的那张牌放到牌靴底，牌局结果依视讯显示为准，牌局将如常进行；若该张多补的牌已亮开，公务将在做完以上同样程序后换上新牌靴，牌局会重新开始。</li>' +
          '<li>荷官未依闲、庄发牌正确顺序将牌放错位置，由工务将牌依正确顺序摆放回位置后牌局将照常继续。</li>' +
          '<li>开牌过程中，牌有感应但无显示，荷官已亮牌（如: 已派出数张牌，但第一张牌有感应但未显示，至第二、三张牌显示在错误的闲、庄位置上），现场工务会依牌的正确次序输入代码，牌局将如常继续。</li>' +
          '<li>同一张牌，扫描了一次出现2张（闲、庄位置各一张）<br>（a）若牌局已开牌，而结果不符，系统将根据视讯荷官完成该局之正确结果进行手动开牌，牌局也将在牌路无误的情况下如常继续。&nbsp;<br>（b）若牌局未开牌，荷官避开扫描如常开牌后，工务将输入牌之正确数码，并修正不符那张牌的 花色、点数，牌局会如常继续。</li>' +
          '<li>电脑、扫描器出现异常、牌局中断、牌无法扫描又无法输入牌卡数码时，那一个牌局便会作废，所有程式将被关闭，并重开程式，牌局将重新开始。但若荷官发牌视讯已有结果，则以视讯开牌为主，会由系统完成开配。</li>' +
          '<li>有关例行性维护、网路问题、视讯中断、牌局作废、注销情况等事宜，皆可于会员端左上角处公告栏上得知最新讯息。</li>' +
          '<li>发牌视讯仅保留三日，若有异议请于游戏当日起三日内提出，三日后恕不受理。</li>' +
          '<li>本娱乐场之视讯为真人直播，故该局游戏若因国际线路传输问题出现争议，将以视讯看到牌局结果决定输赢。</li>' +
          '<li>本娱乐场所提供之牌路仅供参考，若因国际线路问题或其他因素造成牌路显示有误，所有游戏结果将以视讯开牌及游戏记录为主。</li>' +
          '<li>本公司保留一切有争议事项的修正及最后的决策。</li>' +
          '<li>本娱乐场保留随时更改、修订或删除游戏、游戏规则（包括机率及赔率）及协议条款的权利而无须作事先通知。</li>' +
          '<li>本娱乐场保留随时修订、撤销或中止任何投注的权利而无须作事先通知，亦无须作任何解释。</li>' +
          '<li>本娱乐场记录每一项于本网站伺服器内执行的交易及投注功能。若会员认为向本娱乐场提供的资料与本网站资料库中的资料记录之间出现了任何声称的差异，一切均以本网站资料库的资料为准。</li>' +
          '<li>当会员已于本娱乐场之游戏厅内下注，而电脑出现连线异常导致牌局中断时，会员最后押住仍视为有效，本娱乐场将以会员于本网站资料库的交易记录为准。</li>' +
          '<li>会员在本娱乐场之游戏厅内任何游戏的押注记录均视为有效，会员需自行承担下注后的风险。</li>' +
          '<li>若经本公司发现会员以不正当手法&lt;利用外挂程式&gt;进行投注或以任何非正常方式进行的个人、团体投注有损公司利益之投注情事发生，本公司保留取消该类注单之权利。</li>' +
          '</ol>'
      },
      {
        title: '体育投注',
        selcted: false,
        content:
          '<ol>' +
          '<li>当您在下注之后，请等待显示下注成功信息。</li>' +
          '<li>为了避免出现争论，您必须在下注之后检查下注状况。</li>' +
          '<li>任何[体育投注]的投诉必须在开赛之前提出，不会受理任何开赛之后的投诉。</li>' +
          '<li>所有赛事投注项目(包括滚球)，出现任何打字错误或非人为故意失误之注单，一律取消。</li>' +
          '<li>除滚球外，开赛后接受的投注，将被视为“无效”。</li>' +
          '<li>倘若发生不可抗拒之灾害或骇客入侵破坏行为，造成网站故障或资料毁损等情况，以本公司 网站公告讯息为最后处理模式，请各会员投注后列印资料本公司才接受投诉！</li>' +
          '<li>即日起任何异常或争议之注单，将不计算结果；并转移至当日历史帐户于结果栏位注明"已注销"。</li>' +
          '<li>下注时出现同时同分同秒及内容相同2笔以上之注单，本公司只承认一笔有效注单，其余一律注销。</li>' +
          '<li>由于走地时系统资料处理繁忙，如发现刻意于“走地进球后之交易资料一律取消，不便之处，敬请见谅！</li>' +
          '<li>走地进球后，如因网页系统或线路状况..等问题而导致比分或赔率无法更新，所有相关交易资料“一律取消”。</li>' +
          '<li>滚球注单下注过程中若显示[等待中]，该注单尚未被本公司确认接受；客户可至下注状况与帐户历史确认，若该滚球注单确定未被本公司接受，可至帐户历史查看该注单结果会显示[未接受]并且画横线！</li>' +
          '<li>在赛事开赛前,比赛队伍之主场或中立场若有任何更改,本公司将依据盘口与行情差距而保留更改前的注单是否有效之权利,所有判决将于走马灯公告上公布!</li>' +
          '<li>早餐取消之注单可于"下注状况"查询,当日以前(含当日)取消之注单将放于"帐户历史"并于结果栏位注明"取消",敬请各会员查询后重新交易!</li>' +
          '<li>若经本公司发现会员以不正当手法&lt;利用外挂程式&gt;进行投注或以任何非正常方式进行的个人、团体投注有损公司利益之投注情事发生，本公司保留取消该类注单之权利，并于注单取消时，备注此注单为『非法下注』或『系统注销』(含完赛后之注单)。</li>' +
          '</ol>'
      },
      {
        title: '其他游戏',
        selcted: false,
        content:
          '<p>● 彩票类游戏</p>' +
          '<ol>' +
          '<li>当您在下注之后，请等待显示“下注成功”资讯。</li>' +
          '<li>为了避免出现争论，您必须在下注之后检查“下注状况”。</li>' +
          '<li>任何的投诉必须在开彩之前提出，本公司不会受理任何开彩之后的投诉。</li>' +
          '<li>所有投注项目，公布赔率时出现的任何打字错误或非故意人为失误，本公司保留改正错误和按正确赔率结算投注的权力。</li>' +
          '<li>开彩后的投注，将被视为“无效”。所有赔率将不时浮动，派彩时的赔率将以确认投注时之赔率为准。</li>' +
          '<li>所有赛果以官方网站公布的结果为依据，若因官网延迟、错误或取消；本公司保留对已下注注单的裁决权。</li>' +
          '<li>若发生两颗球同时吸起，将依照在结果区之号码球为主。</li>' +
          '<li>在游戏尚未完成开配之前，若因机器问题而导致有结果产生，该局将一律注销。</li>' +
          '<li>在下注时间尚未结束之前，若因任何因素导致有结果产生，该局将一律注销。</li>' +
          '<li>若该局己有结果但与实际结果不符，系统将根据视讯完成该局之正确结果进行手动开牌。</li>' +
          '</ol>' +
          '<p>● 电子游艺</p>' +
          '<ol>' +
          '<li>电子游戏中奖画面与派彩结果不符时，本公司将以资料库最终结果为依据。</li>' +
          '<li>彩池金额是以满注中奖结果显示，玩家中奖系以押注比例分配彩池金额。</li>' +
          '<li>老虎机游戏过程中如遇断线情况将以资料库最终结果为依据，本公司保留对已下注注单的裁决权。</li>' +
          '<li>21点游戏补牌中如遇玩家断线，则视玩家为不补牌；游戏结果将视为有效。</li>' +
          '<li>红狗游戏过程中如遇断线情况将视为玩家不加注进行补牌，完成该局游戏结果。</li>' +
          '</ol>'
      }
    ],
    // 文案form表单校验规则和提示语
    regular: {
      name: {regular: /^[a-zA-Z0-9\u4e00-\u9fa5]+$/, warn: '您输入的名字格式不正确', error: ''},
      phone: {regular: /^1[0-9][0-9]{9}$/, warn: '您输入的联络电话格式不正确', error: ''},
      qqOrSkype: {regular: /^((\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*)|([1-9][0-9]{4,}))$/, warn: '您输入的QQ或Skype格式不正确', error: ''},
      email: {regular: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/, warn: '您输入的电邮信箱格式不正确', error: ''},
      content: {regular: '', warn: '', error: ''},
      common: ['phone', 'qqOrSkype', 'email'],
      commonTip: '请输入电话、QQ或Skype、电邮信箱中的一种'
    },
    contactData: {
      name: {value: '', valid: false, show: false, name: 'name', tip: ''},
      phone: {value: '', valid: false, show: false, name: 'phone', tip: ''},
      qqOrSkype: {value: '', valid: false, show: false, name: 'qqOrSkype', tip: ''},
      email: {value: '', valid: false, show: false, name: 'email', tip: ''},
      content: {value: '', valid: false, show: false, name: 'content', tip: ''}
    },
    // 游戏类型
    gameType: {
      'Baccarat': '百家乐',
      'Roulette': '轮盘',
      'Sic Bo': '骰宝',
      'DragonTiger': '龙虎',
      'Blackjack': '二十一点',
      '3001': '百家乐',
      '3002': '二八杠',
      '3003': '龙虎斗',
      '3005': '三公',
      '3006': '温州牌九',
      '3007': '轮盘',
      '3008': '骰宝',
      '3010': '德州扑克',
      '3011': '色碟',
      '3012': '牛牛',
      '3013': '赛本引',
      '3014': '无限21点',
      '3015': '番摊',
      '3016': '魚蝦蟹'
    },
    // 会员中心-往来记录-交易类型对应关系
    tradeType: {
      '1': '存入',
      '2': '取出',
      '3': '派彩',
      '4': '下注',
      '5': '返水', // 改为返水
      '6': '取消注单',
      '7': '取消结算',
      '8': '统算',
      '12': '公司入款',
      '13': '公司入款优惠',
      '14': '公司汇款优惠',
      '15': '线上存款',
      '16': '线上存款手续费',
      '17': '线上存款优惠',
      '18': '系统取消出款',
      '19': '入款其他',
      '21': '冲销',
      '22': '重复出款',
      '23': '手动申请出款',
      '24': '放弃存款优惠',
      '25': '公司入款误存',
      '26': '会员负数回冲',
      '27': '扣除非法下注派彩',
      '28': '出款其他',
      '31': '人工存入',
      '32': '人工存入取消出款',
      '33': '存款优惠',
      '34': '人工存入汇款优惠',
      '35': '退佣优惠',
      '36': '负数额度归零',
      '37': '人工存入其他',
      '38': '人工存入存款优惠',
      '41': '层级额度转换',
      '42': '系统新增快开额度',
      '43': '转至体育投注失败',
      '44': '由体育投注转入',
      '45': '转至体育投注',
      '46': '钱包存入',
      '47': '钱包取出',
      '57': 'API存入',
      '58': 'API取出',
      '88': 'API存入异常',
      '89': 'API取出异常',
      '80': 'OPUS返点',
      '81': 'OPUS冲销',
      '48': '开分-几率',
      '49': '洗分-几率',
      '51': '强制设定',
      '53': '重建下注（重建）',
      '54': '重结派彩（重结）',
      '55': '回结派彩（回结）',
      '56': '系统结算派彩',
      '60': 'OG返点',
      '61': '体育返点',
      '62': '视讯返点',
      '63': '电子返点',
      '64': '彩票返点',
      '65': 'HG返点',
      '52': 'AG返点',
      '66': 'EA返点',
      '67': 'BB视讯返点',
      '68': 'MG视讯返点',
      '69': 'MG电子返点',
      '10': 'BB体育返点',
      '11': 'BB彩票返点',
      '20': 'BB电子返点',
      '50': 'BB3D返点',
      '70': 'OG冲销',
      '71': '体育冲销',
      '72': '视讯冲销',
      '73': '电子冲销',
      '74': '传统彩冲销',
      '75': 'HG冲销',
      '59': 'AG冲销',
      '76': 'EA冲销',
      '77': 'BB视讯冲销',
      '78': 'MG视讯冲销',
      '79': 'MG电子冲销',
      '29': 'BB体育冲销',
      '30': 'BB彩票冲销',
      '39': 'BB电子冲销',
      '40': 'BB3D冲销',
      '82': '重新结算',
      '83': '未接受-体育',
      '84': '重复派彩扣回',
      '85': '系统踢单-彩票',
      '86': '彩金',
      '91': '取消实际出款',
      '92': '取消扣除手续费',
      '93': '取消扣除存款优惠',
      '95': '实际出款',
      '96': '出款扣除手续费',
      '97': '出款扣除存款优惠',
      '98': '沙巴体育返点',
      '99': '沙巴体育冲销',
      '100': 'DIOS冲销',
      '101': 'DIOS返点',
      '102': 'PT电子冲销',
      '103': 'PT电子返点',
      '104': 'LEBO视讯冲销',
      '105': 'LEBO视讯返点',
      '106': 'OGS视讯冲销',
      '107': 'OGS视讯返点',
      '108': 'AB视讯冲销',
      '109': 'AB视讯返点',
      '110': 'OG电子冲销',
      '111': 'OG电子返点',
      '118': 'MWG电子冲销',
      '119': 'MWG电子返点',
      '120': '传统彩冲销',
      '121': '传统彩返点',
      '138': '拒绝出款',
      '139': '代理总冲销',
      '140': '代理返水明细',
      '141': '代理冲销明细',
      '142': '代理返水转出',
      '143': '代理返水转入',
      '146': '拒绝出款',
      '147': '活动优惠',
      '148': '代理余额存入',
      '149': '代理余额取出',
      '152': '会员余额存入',
      '155': '第三方额度存入'
    },
    // 往来记录如果是这里面的，备注直接取remark的值
    tradeRemark1: ['3', '4', '5', '6', '7', '21', '53', '54', '55', '56', '91', '95', '146', '152', '155'],
    // 往来记录如果是这里面的，备注取detailInfo的值。
    tradeRemark2: ['37', '38', '19', '22', '23', '24', '25', '26', '27', '28', '31', '32', '33', '35', '36', '34', '47', '46', '57', '58', '88', '89', '143', '147']
  }
  // OT-5166 不知具体位置对window.common做了重新赋值，导致跳转第三方时找不到closeLtWindow方法，此处重新赋值closeLtWindow
  window.common.closeLtWindow = function () {
    /* --------------- 关闭当前窗口（需做根据不同浏览器使用不同的关闭方法） start --------------------------------------------- */
    if (navigator.userAgent.indexOf('MSIE') > 0) { // IE
      if (navigator.userAgent.indexOf('MSIE 6.0') > 0) { // IE6
        window.opener = null
        window.close()
      } else { // IE6+
        window.open('', '_top')
        window.top.close()
      }
    } else if (navigator.userAgent.indexOf('Firefox') > 0 || navigator.userAgent.indexOf('Presto') > 0) { // FF和Opera
      // window.location.href = 'about:blank'
      window.close()// 火狐默认状态非window.open的页面window.close是无效的
    } else {
      window.opener = null
      window.open('', '_self', '')
      window.close()
    }
    /* --------------- 关闭当前窗口（需做根据不同浏览器使用不同的关闭方法） end --------------------------------------------- */
  }
}())
