let sms = {
  'register': {
    'pact': '请勾选接受相关条款和隐私协议!',
    '账号为6-12位英文与数字的组合或纯字母！': '请输入正确的账号格式',
    '密码长度不能少于6个字元': '请输入正确的密码格式',
    '密码必须是6-12位英文或数字与字母组合！': '请输入正确的密码格式',
    '确认密码错误！请重新输入！': '请输入正确的确认密码格式',
    '请输入真实姓名！': '请输入真实姓名',
    '请输入4位取款密码！': '请输入正确的取款密码格式',
    '请填写取款密码！': '请输入正确的取款密码格式',
    '请输入手机号！': '请输入正确的手机格式',
    '请输入正确的手机格式': '请输入正确的手机格式',
    '请输入邮箱地址！': '请输入正确的邮箱格式',
    '您输入的邮箱格式不正确！': '请输入正确的邮箱格式',
    '请输入QQ!!': '请输入正确的QQ格式',
    'QQ输入格式不正确！': '请输入正确的QQ格式',
    '请输入昵称！': '请输入正确的昵称格式',
    '请输入英文姓名！': '请输入正确的英文名称格式',
    '请输入国家！': '请输入正确的国家格式',
    '国家格式输入错误！': '请输入正确的国家格式',
    '请输入身份证或护照号！': '请输入正确的证件格式',
    '身份证输入格式不正确！': '请输入正确的证件格式',
    '护照输入格式不正确！': '请输入正确的证件格式',
    '请输入生日！': '请输入正确的生日格式',
    '生日格式输入错误！': '请输入正确的生日格式',
    '请输入4位验证码': '请输入正确的验证码格式',
    '请您填写介绍人': '请输入正确的介绍人格式'
  }
}

export { sms }
