export const mapp = {
    /** 传统彩 */
  2: 2, // 重庆时时彩 ：时时彩系列的传统彩
  3: 2, // 天津时时彩 ：时时彩系列的传统彩
  11: 2, // 新疆时时彩 ：时时彩系列的传统彩
  6: 6, // 北京赛车 ：PK10系列的传统彩
  8: 6, // 幸运飞艇 ：PK10系列的传统彩
  24: 24, // 香港六合彩 ：六合彩系列的传统彩
  5: 5, // 广东快乐十分 ：快乐十分系列的传统彩
  10: 5, // 湖南快乐十分 ：快乐十分系列的传统彩
  13: 5, // 重庆幸运农场 ：快乐十分系列的传统彩
  16: 16, // 广西快乐十分 ： 广西快乐十分系列的传统彩
  9: 9, // 幸运28 ： 快乐8系列的传统彩
  7: 7, // 江苏骰宝 ： 快3系列的传统彩
  18: 18, // 北京快3 ： 快3系列的传统彩
  14: 7, // 广西快3 ： 快3系列的传统彩
  17: 17, // 广东11选5 ： 十一选五系列的传统彩
  15: 15, // 北京快8 ： 快乐8系列的传统彩

    /** 自营彩 */
  40: 40, // 一分时时彩 ： 时时彩系列的自营彩
  42: 40, // 三分时时彩 ： 时时彩系列的自营彩
  43: 40, // 五分时时彩 ： 时时彩系列的自营彩
  100: 40, // 秒秒彩 ： 时时彩系列的自营彩
  101: 44, // 秒秒赛车 ：PK10系列的自营彩
  44: 44, // 一分赛车 ：PK10系列的自营彩
  45: 44, // 三分赛车 ：PK10系列的自营彩
  64: 64, // 一分六合彩 ：六合彩系列的自营彩
  65: 64, // 三分六合彩 ：六合彩系列的自营彩
  66: 64, // 五分六合彩 ：六合彩系列的自营彩
  47: 47, // 一分快乐十分 ：快乐十分系列的自营彩
  48: 47, // 三分快乐十分 ：快乐十分系列的自营彩
  49: 47, // 五分快乐十分 ：快乐十分系列的自营彩
  73: 47, // 一分幸运农场 ：快乐十分系列的自营彩
  74: 47, // 三分幸运农场 ：快乐十分系列的自营彩
  50: 50, // 一分快3 ：快3系列的自营彩
  51: 50, // 三分快3 ：快3系列的自营彩
  52: 50, // 五分快3 ：快3系列的自营彩
  57: 57, // 一分11选5 ：十一选五系列的自营彩
  58: 57// 三分11选5 ：十一选五系列的自营彩
}
