<template>
  <div id="UserAgree" class="yo-tc-body" style="display: block;" v-if="showCheck">
    <div class="yo-tc-yhxy">
      <div class="yo-t-title">
        <h1>用户协议</h1>
        <a class="yo-tc-cloes" href="javascript:;" @click="agree">关闭</a>
      </div>
      <div class="yo-t-center">
        <div class="yhxy-c-text">
          <h2>立即开通本公司游戏账户，享受最优惠的各项红利！</h2>
          <ul>
            <li>本公司只接受年龄已满18岁的客户申请，同时我们保留客户提供其年龄证明的权利。</li>
            <li>在公司进行注册时所提供的全部信息必须准确无误，在使用借记卡或信用卡时，持卡人的姓名必须与在网站上注册时的一致。</li>
            <li>在开户后进行一次有效存款，即成为本公司永久有效会员！</li>
            <li>成为本站有效会员后，客户可随时通过电邮、联系在线客服、或在本公司站点上留言、联系客服等方式，随时向本公司提供最新的个人资料。</li>
            <li>本公司如发现个别会员有重复申请账号行为时，本公司有权将这些账户视为一个联合账户。本公司保留取消、收回会员所有优惠红利，以及优惠红利所产生的盈利之权利。本公司系统严格要求玩家、住址、电邮、电话号码、支付卡/信用卡均为唯一性，任何共享计算机环境 (例如:网吧、其他公共用计算机等)只能够拥有一个会员账号，各项优惠只适用于每位客户在本公司站点唯一的账户。</li>
            <li>本公司是提供互联网投注服务的机构。请会员在注册前参考当地政府的法律，在博彩不被允许的地区，如有会员在本公司注册、投注，均为会员个人行为，本公司不负责、承担任何相关联带责任。</li>
            <li>无论是个人或是团体，如有任何威胁、滥用本公司优惠的行为，本公司将保留权利取消、收回由优惠产生的红利，并保留权利追讨最高50%手续费。</li>
            <li>所有本公司游戏娱乐站点的优惠是特别为玩家而设，在玩家注册信息有争议时，为确保双方利益、杜绝身份盗用行为，本公司保留权利要求客户向我们提供充足有效的文件， 并以各种方式辨别客户是否符合资格享有我们的任何优惠。</li>
            <li>客户一经注册开户，将被视为接受所有颁布在本以公司互联网投注网站上的规则与条例。</li>
          </ul>
          <p class="star">本公司是使用传奇软件所提供的在线娱乐软件，如发现个别会员在同系统的多个娱乐城上开设多个会员账户，并进行套利下注,经核实后,本公司将冻结参与的会员账号并将所有下注盈利取消！</p>
        </div>
      </div>
      <div class="yo-t-bot">
        <a href="javascript:;" class="yo-tc-cloes" @click="agree" >我已届满合法博彩年龄，且同意各项开户条约。</a>
      </div>
    </div>
  </div>
</template>

<script>
/*
 vue 单独编译注释：
 单独编译
 * */
export default {
  name: 'UserAgree',
  props: ['showCheck', 'agree'],
  data () {
    return {
    }
  },
  methods: {
    newSaveContact () {
      this.checkMsg()
    }
  }
}
</script>

